gcoonrod/stm32-shift-display/firmware/src/main.cpp
#include <Arduino.h>
#include <ShiftDisplay.h>
#include <ShiftDisplayFSM.h>
#include <STM32RTC.h>
#include <AceButton.h>
#include <SerialCommands.h>
#include <stdlib.h>
#include "header.h"

#define SERIAL_COMMANDS_DEBUG

using namespace ace_button;

#define SER PA3
#define SRCLK PA4
#define SRCLRB PA1
#define RCLK PA2
#define OEB PA0

/**
 * User LEDs. The positional names below are how the LEDs sit on the board; note
 * that they run opposite to the schematic's D-numbering, which is a trap worth
 * keeping in mind when cross-referencing:
 *
 *   LED_TOP  PB8  net /LED3  schematic D3  -> AM indicator (12-hour mode only)
 *   LED_MID  PB7  net /LED2  schematic D2  -> 12-hour mode active
 *   LED_BOT  PB6  net /LED1  schematic D1  -> alarm armed (steady) / firing (blink)
 *
 * All three are active high: the cathodes tie to GND through their resistors.
 */
#define LED_BOT PB6
#define LED_MID PB7
#define LED_TOP PB8
#define BTN_SET PB5
#define BTN_PLUS PB4
#define BTN_MINUS PB3

// Utility types
enum ButtonState
{
  PRESSED,
  RELEASED,
  CLICKED,
  LONG_PRESSED,
  REPEATED,
  UNCHANGED
};

ShiftDisplay display(SER, SRCLK, SRCLRB, RCLK, OEB);
ShiftDisplayFSM stateMachine;

char serial_command_buffer_[32];
SerialCommands serial_commands_(&Serial, serial_command_buffer_, sizeof(serial_command_buffer_), "\r\n", " ");
void cmd_unrecognized(SerialCommands *sender, const char *cmd);
void cmd_test(SerialCommands *sender);
void cmd_set_time(SerialCommands *sender);
void cmd_get_time(SerialCommands *sender);
void cmd_set_offset(SerialCommands *sender);
void cmd_get_offset(SerialCommands *sender);
void cmd_get_mode(SerialCommands *sender);
void cmd_set_mode(SerialCommands *sender);
void cmd_get_alarm(SerialCommands *sender);
void cmd_set_alarm(SerialCommands *sender);
void cmd_alarm_enable(SerialCommands *sender);
void cmd_get_leds(SerialCommands *sender);
void cmd_get_bright(SerialCommands *sender);
void cmd_set_bright(SerialCommands *sender);
void cmd_get_disp(SerialCommands *sender);
void cmd_get_backup(SerialCommands *sender);
void cmd_set_disp(SerialCommands *sender);

SerialCommand cmd_test_("TEST", cmd_test);
SerialCommand cmd_set_time_("ST", cmd_set_time);
SerialCommand cmd_get_time_("GT", cmd_get_time);
SerialCommand cmd_set_offset_("SO", cmd_set_offset);
SerialCommand cmd_get_offset_("GO", cmd_get_offset);
SerialCommand cmd_get_mode_("GM", cmd_get_mode);
SerialCommand cmd_set_mode_("SM", cmd_set_mode);
SerialCommand cmd_get_alarm_("GA", cmd_get_alarm);
SerialCommand cmd_set_alarm_("SA", cmd_set_alarm);
SerialCommand cmd_alarm_enable_("AE", cmd_alarm_enable);
SerialCommand cmd_get_leds_("GL", cmd_get_leds);
SerialCommand cmd_get_bright_("GI", cmd_get_bright);
SerialCommand cmd_set_bright_("SI", cmd_set_bright);
SerialCommand cmd_get_disp_("GD", cmd_get_disp);
SerialCommand cmd_set_disp_("SD", cmd_set_disp);
SerialCommand cmd_get_backup_("GB", cmd_get_backup);

STM32RTC &rtc = STM32RTC::getInstance();
DateTimeBuffer_t date_time_buf = {0, 1, RTC_MONTH_JANUARY, 1, 0, 0, 0};
bool time_dirty = true;
int8_t timezoneOffset = -6; // CST

/**
 * Settings that outlive a power cut, held in the backup domain on VBAT.
 *
 * Register budget on the F103C8 is DR1..DR10, and most of it is already spoken
 * for: the core claims DR1 (RTC_BKP_INDEX), DR4 (HID_MAGIC_NUMBER_BKP_INDEX) and
 * DR10 in backup.h, and STM32RTC stores the F1's emulated date across DR6 and
 * DR7 (RTC_BKP_DATE). Writing any of those would corrupt someone else's state --
 * the date one in particular would surface as a clock bug, not a settings bug.
 * DR2, DR3 and DR5 are free.
 */
#define BKP_MAGIC_REG LL_RTC_BKP_DR2
#define BKP_FLAGS_REG LL_RTC_BKP_DR3
#define BKP_ALARM_REG LL_RTC_BKP_DR5
/* Low byte: indicator level, stored as-is. High byte: display level, stored
   offset by one so that zero means "never written".
   
   The low byte shipped first, and the high byte was left as zero. Storing the
   display level raw would make that zero indistinguishable from a deliberate
   level 0 -- the dimmest setting -- so every device already in the field would
   come up looking blank on the first boot after this change. The offset costs a
   byte of arithmetic and avoids resetting the settings that are already there. */
#define BKP_BRIGHT_REG LL_RTC_BKP_DR8
#define BKP_MAGIC_VALUE 0xC10CU

#define FLAG_MODE_12 0x1U
#define FLAG_ALARM_ARMED 0x2U

typedef struct
{
  bool mode12;
  bool alarmArmed;
  uint8_t alarmHour;
  uint8_t alarmMinute;
  uint8_t indicatorLevel; // index into led_gamma
  uint8_t displayLevel;   // index into disp_gamma
} Settings_t;

Settings_t settings = {false, false, 7, 0, 4, 5};

// SET gets its own config; see setup_user_btns() for why it must not share
// the repeat-press feature with PLUS/MINUS.
ButtonConfig setButtonConfig;
AceButton btnSet(BTN_SET);
AceButton btnPlus(BTN_PLUS);
AceButton btnMinus(BTN_MINUS);

ButtonState btnSetState = ButtonState::UNCHANGED;
ButtonState btnPlusState = ButtonState::UNCHANGED;
ButtonState btnMinusState = ButtonState::UNCHANGED;

// Values being edited. Copied in when an editor is entered and only written
// through on commit, so backing out discards them.
uint8_t edit_field[3] = {0, 0, 0};
MenuState edit_item = MENU_NONE;

volatile bool alarm_fire_request = false;

// What the very first backup-register read returned at boot, captured before
// anything can overwrite it. If settings_load() misreads the magic on a cold
// start it rewrites defaults over the saved values, which destroys them
// permanently -- this is how to tell that apart from the registers themselves
// having been cleared.
uint32_t boot_magic_seen = 0xFFFFFFFFU;
uint32_t boot_flags_seen = 0xFFFFFFFFU;
uint32_t boot_alarm_seen = 0xFFFFFFFFU;
uint32_t boot_bright_seen = 0xFFFFFFFFU;

bool output_en = false;

uint32_t last_activity_ms = 0;

// What was last shifted out, so the display is only re-latched when it changes.
char last_rendered[7] = {0};
uint8_t last_rendered_dp = 0xFF;

#define BLINK_PERIOD_MS 300
#define BREATH_PERIOD_MS 2500

/**
 * Indicators run at 12-bit PWM, not the core's 8-bit default. Eight bits is
 * plenty for steady indicators but not for fading between them: at the dim end
 * a single duty step is a large fraction of the light output -- duty 4 to 5 is a
 * 25% jump -- so a breath built on 256 steps visibly staircases however fast it
 * is updated. 4096 steps put those jumps below the threshold where the eye
 * separates them. MAX_PWM_RESOLUTION is 16, so this is well inside what the
 * core supports.
 */
#define PWM_BITS 12
#define PWM_MAX_DUTY 4095
/* 1 kHz would probably do, but a bright high-contrast source at low duty seen at
   the edge of vision is where PWM flicker gets noticed, and a clock is looked at
   sideways constantly. 4 kHz costs nothing: the timer reload is still about
   18000 counts, far more than the 4096 duty steps, so resolution is untouched.
   Resolution would only start to suffer above roughly 17 kHz. */
#define PWM_FREQ_HZ 4000

/**
 * Indicator brightness levels, mapped to duty on a gamma curve. Luminous output
 * is linear in duty but perceived lightness is not -- roughly luminance^(1/2.2) --
 * so evenly spaced duty values feel bunched at the bottom and flat at the top.
 * A table beats pow() on a core with no FPU, and at eight entries it costs eight
 * bytes. The lowest entry is floored above the curve's own value so the dimmest
 * setting stays visible rather than reading as a failed LED.
 */
#define LED_LEVELS 8
static const uint16_t led_gamma[LED_LEVELS] = {64, 194, 473, 891, 1456, 2175, 3053, 4095};

/* The same curve for the display, with a higher floor: an indicator only has to
   be visible at its dimmest, whereas the display has to stay readable. */
#define DISP_LEVELS 8
static const uint16_t disp_gamma[DISP_LEVELS] = {128, 259, 546, 964, 1529, 2248, 3126, 4095};
#define MENU_TIMEOUT_MS 10000

// Function definitions
void setup_user_leds();
void setup_user_btns();
void setup_rtc();
void setup_usb();
void settings_load();
void settings_save();
void update_leds();
void update_display_brightness();
void render();
void handle_input();
void begin_edit();
void adjust_field(int8_t delta);
void commit_edit();

// IRQ Handlers and Event Callbacks
void handleEvent(AceButton *, uint8_t, uint8_t);
void irq_rtc_seconds(void *data);
void irq_timer_led();

static inline bool blink_on()
{
  return ((millis() / BLINK_PERIOD_MS) % 2) == 0;
}

void setup()
{
  // analogWrite's resolution and frequency are global, shared by the indicator
  // LEDs on TIM4 and the display's ~OE on TIM2. Set once, here, before anything
  // uses them -- tuning one feature must not silently change the other.
  analogWriteResolution(PWM_BITS);
  analogWriteFrequency(PWM_FREQ_HZ);

