gcoonrod/stm32-shift-display/firmware/src/main.cpp
void setup_usb()
{
  Serial.println(F("Shift Clock Started"));
}

void settings_load()
{
  enableBackupDomain();

  boot_magic_seen = getBackupRegister(BKP_MAGIC_REG);
  boot_flags_seen = getBackupRegister(BKP_FLAGS_REG);
  boot_alarm_seen = getBackupRegister(BKP_ALARM_REG);
  boot_bright_seen = getBackupRegister(BKP_BRIGHT_REG);

  if (boot_magic_seen != BKP_MAGIC_VALUE)
  {
    // Backup memory has never held settings (fresh coin cell, or first run of
    // this firmware). Without the magic, arbitrary contents would read as a
    // valid configuration.
    settings_save();
    return;
  }

  uint32_t flags = getBackupRegister(BKP_FLAGS_REG);
  settings.mode12 = (flags & FLAG_MODE_12) != 0;
  settings.alarmArmed = (flags & FLAG_ALARM_ARMED) != 0;

  uint32_t alarm = getBackupRegister(BKP_ALARM_REG);
  settings.alarmHour = (alarm >> 8) & 0xFF;
  settings.alarmMinute = alarm & 0xFF;

  uint32_t brightness = getBackupRegister(BKP_BRIGHT_REG);
  settings.indicatorLevel = brightness & 0xFF;
  uint8_t storedDisplay = (brightness >> 8) & 0xFF;
  settings.displayLevel = storedDisplay ? (storedDisplay - 1) : (DISP_LEVELS / 2);
  if (settings.indicatorLevel >= LED_LEVELS)
  {
    settings.indicatorLevel = LED_LEVELS / 2;
  }
  if (settings.displayLevel >= DISP_LEVELS)
  {
    settings.displayLevel = DISP_LEVELS / 2;
  }

  if (settings.alarmHour > 23)
  {
    settings.alarmHour = 0;
  }
  if (settings.alarmMinute > 59)
  {
    settings.alarmMinute = 0;
  }
}

void settings_save()
{
  enableBackupDomain();

  uint32_t flags = 0;
  if (settings.mode12)
  {
    flags |= FLAG_MODE_12;
  }
  if (settings.alarmArmed)
  {
    flags |= FLAG_ALARM_ARMED;
  }

  setBackupRegister(BKP_FLAGS_REG, flags);
  setBackupRegister(BKP_ALARM_REG, ((uint32_t)settings.alarmHour << 8) | settings.alarmMinute);

  setBackupRegister(BKP_BRIGHT_REG,
                    (((uint32_t)settings.displayLevel + 1) << 8) | settings.indicatorLevel);

  setBackupRegister(BKP_MAGIC_REG, BKP_MAGIC_VALUE);
}

// Hours as they should be shown. The RTC stays in HOUR_24 whatever the display
// mode is, so the serial commands keep reading and writing the same values.
static uint8_t display_hours(uint8_t hours24)
{
  if (!settings.mode12)
  {
    return hours24;
  }

  uint8_t h = hours24 % 12;
  return (h == 0) ? 12 : h;
}

void update_leds()
{
  uint16_t peak = led_gamma[effective_indicator_level()];

  bool am = settings.mode12 && (date_time_buf.hours < 12);
  uint16_t bot;

  if (stateMachine.getState() == State::FIRING)
  {
    bot = breath_duty(peak);
  }
  else
  {
    bot = settings.alarmArmed ? peak : 0;
  }

  apply_leds(am ? peak : 0, settings.mode12 ? peak : 0, bot);
}

// Write a two-digit value at pos, or blank it out when it should be hidden.
static void put2(char *buf, uint8_t pos, uint8_t value, bool visible)
{
  if (visible)
  {
    buf[pos] = '0' + ((value / 10) % 10);
    buf[pos + 1] = '0' + (value % 10);
  }
  else
  {
    buf[pos] = ' ';
    buf[pos + 1] = ' ';
  }
}

static void render_menu(char *buf)
{
  const char *label;
  switch (stateMachine.getMenuState())
  {
  case MENU_TIME:
    label = " CLOC ";
    break;
  case MENU_DATE:
    label = " DAtE ";
    break;
  case MENU_MODE:
    label = " 12-24";
    break;
  case MENU_ALARM:
    label = " ALArn";
    break;
  case MENU_BRIGHT:
    label = " LEd  ";
    break;
  case MENU_DISP:
    label = " dISP ";
    break;
  default:
    label = "      ";
    break;
  }
  memcpy(buf, label, 6);
}

static void render_edit(char *buf)
{
  uint8_t field = stateMachine.getField();
  bool show = blink_on();

  memcpy(buf, "      ", 6);

  switch (edit_item)
  {
  case MENU_TIME:
    put2(buf, 0, edit_field[0], (field != 0) || show);
    put2(buf, 2, edit_field[1], (field != 1) || show);
    put2(buf, 4, edit_field[2], (field != 2) || show);
    break;

  case MENU_DATE:
    put2(buf, 0, edit_field[0], (field != 0) || show);
    put2(buf, 2, edit_field[1], (field != 1) || show);
    put2(buf, 4, edit_field[2], (field != 2) || show);
    break;

  case MENU_MODE:
    if (show)
    {
      memcpy(buf, edit_field[0] ? "  12Hr" : "  24Hr", 6);
    }
    break;

  case MENU_ALARM:
    if (field < 2)
    {
      put2(buf, 0, edit_field[0], (field != 0) || show);
      put2(buf, 2, edit_field[1], (field != 1) || show);
    }
    else if (show)
    {
      memcpy(buf, edit_field[2] ? "    On" : "   OFF", 6);
    }
    break;

  case MENU_BRIGHT:
    // Levels read 1..8 rather than 0..7; the indicators themselves are the preview.
    memcpy(buf, "LEd   ", 6);
    put2(buf, 4, edit_field[0] + 1, show);
    break;

  case MENU_DISP:
    memcpy(buf, "dISP  ", 6);
    put2(buf, 4, edit_field[0] + 1, show);
    break;

  default:
    break;
  }
}

void render()
{
  char buf[7];
  uint8_t dp = 0;

  buf[6] = '\0';

  switch (stateMachine.getState())
  {
  case State::MENU:
    render_menu(buf);
    break;

  case State::EDIT:
    render_edit(buf);
    break;

  case State::FIRING:
    // Flash the whole display so a firing alarm cannot be mistaken for the clock.
    if (blink_on())
    {
      put2(buf, 0, display_hours(date_time_buf.hours), true);
      put2(buf, 2, date_time_buf.minutes, true);
      put2(buf, 4, date_time_buf.seconds, true);
      dp = 0b00001000;
    }
    else
    {
      memcpy(buf, "      ", 6);
    }
    break;

  case State::IDLE:
  default:
    put2(buf, 0, display_hours(date_time_buf.hours), true);
    put2(buf, 2, date_time_buf.minutes, true);
    put2(buf, 4, date_time_buf.seconds, true);
    dp = 0b00001000;
    time_dirty = false;
    break;
  }

  // Only re-shift and latch when something actually changed; the idle path
  // would otherwise re-shift six characters every pass of the loop.
  if (dp != last_rendered_dp || memcmp(buf, last_rendered, 6) != 0)
  {
    display.writeDisplay(buf, dp);
    display.latch();
    memcpy(last_rendered, buf, 6);
    last_rendered[6] = '\0';
    last_rendered_dp = dp;
  }
}

void begin_edit()
{
  edit_item = stateMachine.getMenuState();

  switch (edit_item)
  {
  case MENU_TIME:
    edit_field[0] = date_time_buf.hours;
    edit_field[1] = date_time_buf.minutes;
    edit_field[2] = date_time_buf.seconds;
    break;

  case MENU_DATE:
    edit_field[0] = date_time_buf.day;
    edit_field[1] = date_time_buf.month;
    edit_field[2] = date_time_buf.year;
    break;

  case MENU_MODE:
    edit_field[0] = settings.mode12 ? 1 : 0;
    break;

