gcoonrod/stm32-shift-display/firmware/src/main.cpp
void cmd_set_hour(SerialCommands *sender)
{
  char *hour_str = sender->Next();
  if (hour_str == NULL)
  {
    sender->GetSerial()->println("ERROR NO_HOUR");
    return;
  }

  int hour = atoi(hour_str);
  if (hour < 0 || hour >= 24)
  {
    print_range_error(sender->GetSerial(), "HOUR", hour, hour_str);
    return;
  }

  date_time_buf.hours = hour;
  rtc.setHours(hour);
}

void cmd_set_minute(SerialCommands *sender)
{
  char *m_str = sender->Next();
  if (m_str == NULL)
  {
    sender->GetSerial()->println("ERROR NO_MINUTE");
    return;
  }

  int m = atoi(m_str);
  if (m < 0 || m >= 60)
  {
    print_range_error(sender->GetSerial(), "MINUTE", m, m_str);
    return;
  }

  date_time_buf.minutes = m;
  rtc.setMinutes(m);
}

void cmd_set_second(SerialCommands *sender)
{
  char *second_str = sender->Next();
  if (second_str == NULL)
  {
    sender->GetSerial()->println("ERROR NO_SECOND");
    return;
  }

  int second = atoi(second_str);
  if (second < 0 || second >= 60)
  {
    print_range_error(sender->GetSerial(), "SECOND", second, second_str);
    return;
  }

  date_time_buf.seconds = second;
  rtc.setSeconds(second);
}

/**
 * Civil-date arithmetic, replacing localtime() and mktime().
 *
 * Those two cost about 5.2 KB between them, and almost none of it is date
 * maths: localtime reaches tzset, which reaches sscanf to parse a TZ string
 * this firmware never sets, which drags in the whole formatted-input engine.
 * The conversion itself is two well-known integer routines over the proleptic
 * Gregorian calendar -- no tables, no locale, no timezone database.
 *
 * Days are counted from 1970-01-01. Month is 1..12 here and everywhere else;
 * see cmd_set_time for why that used to be 0..11 on this path alone.
 */
static int32_t days_from_civil(int32_t y, uint8_t m, uint8_t d)
{
  y -= (m <= 2);
  int32_t era = (y >= 0 ? y : y - 399) / 400;
  uint32_t yoe = (uint32_t)(y - era * 400);
  uint32_t doy = (153U * (m + (m > 2 ? -3 : 9)) + 2U) / 5U + d - 1U;
  uint32_t doe = yoe * 365U + yoe / 4U - yoe / 100U + doy;
  return era * 146097 + (int32_t)doe - 719468;
}

static void civil_from_days(int32_t z, int32_t *y, uint8_t *m, uint8_t *d)
{
  z += 719468;
  int32_t era = (z >= 0 ? z : z - 146096) / 146097;
  uint32_t doe = (uint32_t)(z - era * 146097);
  uint32_t yoe = (doe - doe / 1460U + doe / 36524U - doe / 146096U) / 365U;
  int32_t yr = (int32_t)yoe + era * 400;
  uint32_t doy = doe - (365U * yoe + yoe / 4U - yoe / 100U);
  uint32_t mp = (5U * doy + 2U) / 153U;
  *d = (uint8_t)(doy - (153U * mp + 2U) / 5U + 1U);
  *m = (uint8_t)(mp + (mp < 10U ? 3U : -9U));
  *y = yr + (*m <= 2);
}

typedef struct
{
  int32_t year;   // full year, e.g. 2026
  uint8_t month;  // 1..12
  uint8_t day;
  uint8_t hours;
  uint8_t minutes;
  uint8_t seconds;
} CivilTime_t;

static void civil_from_timestamp(int32_t ts, CivilTime_t *out)
{
  int32_t days = ts / 86400;
  int32_t rem = ts % 86400;
  if (rem < 0)
  {
    rem += 86400;
    days -= 1;
  }

  civil_from_days(days, &out->year, &out->month, &out->day);
  out->hours = (uint8_t)(rem / 3600);
  out->minutes = (uint8_t)((rem % 3600) / 60);
  out->seconds = (uint8_t)(rem % 60);
}

// Returned 64-bit to match what mktime produced here: time_t is 64 bits in this
// toolchain, and an out-of-range date can exceed 32 bits -- GT printed exactly
// such a value before this change, and still must.
static int64_t timestamp_from_civil(const CivilTime_t *t)
{
  return (int64_t)days_from_civil(t->year, t->month, t->day) * 86400LL +
         (int64_t)t->hours * 3600LL + (int64_t)t->minutes * 60LL + t->seconds;
}

void cmd_set_time(SerialCommands *sender)
{
  char *timestampStr = sender->Next();
  if (timestampStr == NULL)
  {
    sender->GetSerial()->println("ERROR NO_TIMESTAMP");
    return;
  }

  int32_t timestamp = (int32_t)atol(timestampStr);
  timestamp += timezoneOffset * 60 * 60;

  CivilTime_t t;
  civil_from_timestamp(timestamp, &t);

  // Month is stored 1..12, matching the RTC and the menu editor. It used to be
  // stored 0..11 on this path only; ST and GT still round-tripped because the
  // same offset was applied on both sides, so the disagreement only showed
  // between the serial and menu paths.
  date_time_buf.hours = t.hours;
  date_time_buf.minutes = t.minutes;
  date_time_buf.seconds = t.seconds;
  date_time_buf.day = t.day;
  date_time_buf.month = t.month;
  date_time_buf.year = (uint8_t)(t.year - 2000);

  rtc.setHours(t.hours);
  rtc.setMinutes(t.minutes);
  rtc.setSeconds(t.seconds);
  rtc.setDay(t.day);
  rtc.setMonth(t.month);
  rtc.setYear((uint8_t)(t.year - 2000));

  sender->GetSerial()->println("OK");
}

void cmd_get_time(SerialCommands *sender)
{

  CivilTime_t t;
  t.year = 2000 + date_time_buf.year;
  t.month = date_time_buf.month;
  t.day = date_time_buf.day;
  t.hours = date_time_buf.hours;
  t.minutes = date_time_buf.minutes;
  t.seconds = date_time_buf.seconds;

  int64_t timestamp = timestamp_from_civil(&t);

  // Apply the timezone offset to change the time to UTC
  timestamp -= (int64_t)timezoneOffset * 60 * 60;

  // Return the current time as a Unix timestamp
  sender->GetSerial()->println((long long)timestamp);
}

void cmd_set_offset(SerialCommands *sender)
{
  char *offsetStr = sender->Next();
  if (offsetStr == NULL)
  {
    sender->GetSerial()->println("ERROR NO_OFFSET");
    return;
  }

  int offset = atoi(offsetStr);
  timezoneOffset = offset;
  sender->GetSerial()->println("OK");
}

void cmd_get_offset(SerialCommands *sender)
{
  sender->GetSerial()->println(timezoneOffset);
}
void cmd_get_mode(SerialCommands *sender)
{
  sender->GetSerial()->println(settings.mode12 ? 12 : 24);
}

void cmd_set_mode(SerialCommands *sender)
{
  char *mode_str = sender->Next();
  if (mode_str == NULL)
  {
    sender->GetSerial()->println("ERROR NO_MODE");
    return;
  }

  int mode = atoi(mode_str);
  if (mode != 12 && mode != 24)
  {
    print_range_error(sender->GetSerial(), "MODE", mode, mode_str);
    return;
  }

  settings.mode12 = (mode == 12);
  settings_save();
  sender->GetSerial()->println("OK");
}

