gcoonrod/stm32-shift-display/firmware/src/main.cpp
void cmd_get_alarm(SerialCommands *sender)
{
  // "<hh> <mm> <armed>"
  Print *out = sender->GetSerial();
  print2(out, settings.alarmHour);
  out->print(' ');
  print2(out, settings.alarmMinute);
  out->print(' ');
  out->println(settings.alarmArmed ? 1 : 0);
}

void cmd_set_alarm(SerialCommands *sender)
{
  char *hour_str = sender->Next();
  if (hour_str == NULL)
  {
    sender->GetSerial()->println("ERROR NO_HOUR");
    return;
  }

  char *minute_str = sender->Next();
  if (minute_str == NULL)
  {
    sender->GetSerial()->println("ERROR NO_MINUTE");
    return;
  }

  int hour = atoi(hour_str);
  if (hour < 0 || hour >= 24)
  {
    print_range_error(sender->GetSerial(), "HOUR", hour, hour_str);
    return;
  }

  int minute = atoi(minute_str);
  if (minute < 0 || minute >= 60)
  {
    print_range_error(sender->GetSerial(), "MINUTE", minute, minute_str);
    return;
  }

  settings.alarmHour = hour;
  settings.alarmMinute = minute;
  settings_save();
  sender->GetSerial()->println("OK");
}

void cmd_alarm_enable(SerialCommands *sender)
{
  char *enable_str = sender->Next();
  if (enable_str == NULL)
  {
    sender->GetSerial()->println("ERROR NO_STATE");
    return;
  }

  int enable = atoi(enable_str);
  if (enable != 0 && enable != 1)
  {
    print_range_error(sender->GetSerial(), "STATE", enable, enable_str);
    return;
  }

  settings.alarmArmed = (enable == 1);
  settings_save();

  // Disarming silences a firing alarm too. Without this the only way out of the
  // firing state is a button press, which leaves no way to stop it from a host.
  if (!settings.alarmArmed && stateMachine.getState() == State::FIRING)
  {
    stateMachine.execute(Action::ALARM_DISMISS);
  }

  sender->GetSerial()->println("OK");
}

void cmd_get_disp(SerialCommands *sender)
{
  // "<level> <duty>" -- the duty makes the active-low inversion checkable from a
  // host: a low level must read a low duty, not a high one.
  Print *out = sender->GetSerial();
  out->print(settings.displayLevel + 1);
  out->print(' ');
  out->println(disp_gamma[effective_display_level()]);
}

void cmd_set_disp(SerialCommands *sender)
{
  char *level_str = sender->Next();
  if (level_str == NULL)
  {
    sender->GetSerial()->println("ERROR NO_LEVEL");
    return;
  }

  int level = atoi(level_str);
  if (level < 1 || level > DISP_LEVELS)
  {
    print_range_error(sender->GetSerial(), "LEVEL", level, level_str);
    return;
  }

  settings.displayLevel = level - 1;
  settings_save();
  sender->GetSerial()->println("OK");
}

void cmd_get_backup(SerialCommands *sender)
{
  // "boot:<magic> <flags> <alarm> <bright>  now:<magic> <flags> <alarm> <bright>"
  // The boot values are what settings_load() saw; the now values are what the
  // registers hold at this moment.
  Print *out = sender->GetSerial();
  out->print("boot:");
  print4hex(out, boot_magic_seen);
  out->print(' ');
  print4hex(out, boot_flags_seen);
  out->print(' ');
  print4hex(out, boot_alarm_seen);
  out->print(' ');
  print4hex(out, boot_bright_seen);
  out->print(" now:");
  print4hex(out, getBackupRegister(BKP_MAGIC_REG));
  out->print(' ');
  print4hex(out, getBackupRegister(BKP_FLAGS_REG));
  out->print(' ');
  print4hex(out, getBackupRegister(BKP_ALARM_REG));
  out->print(' ');
  print4hex(out, getBackupRegister(BKP_BRIGHT_REG));
  out->print(" expect_magic:");
  print4hex(out, BKP_MAGIC_VALUE);
  out->println();
}

void cmd_get_leds(SerialCommands *sender)
{
  // "<top> <mid> <bot>" as duty values, 0-255. Lit means non-zero. Reporting
  // duty rather than a logical level keeps a breathing alarm observable from a
  // host, and digitalRead() is no longer meaningful here anyway: on a pin the
  // timer is driving it samples the live PWM waveform at an arbitrary phase.
  Print *out = sender->GetSerial();
  out->print(led_duty[0]);
  out->print(' ');
  out->print(led_duty[1]);
  out->print(' ');
  out->println(led_duty[2]);
}

void cmd_get_bright(SerialCommands *sender)
{
  sender->GetSerial()->println(settings.indicatorLevel + 1);
}

void cmd_set_bright(SerialCommands *sender)
{
  char *level_str = sender->Next();
  if (level_str == NULL)
  {
    sender->GetSerial()->println("ERROR NO_LEVEL");
    return;
  }

  int level = atoi(level_str);
  if (level < 1 || level > LED_LEVELS)
  {
    print_range_error(sender->GetSerial(), "LEVEL", level, level_str);
    return;
  }

  settings.indicatorLevel = level - 1;
  settings_save();
  sender->GetSerial()->println("OK");
}
